### Snapshot Service Plan: success

<details><summary>Show Plan</summary>

```
module.daily_snapshot.data.external.sources_tar: Reading...
module.daily_snapshot.data.digitalocean_project.forest_project: Reading...
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Reading...
module.daily_snapshot.data.local_file.init: Reading...
module.daily_snapshot.data.local_file.init: Read complete after 0s [id=d773fbd7acbd19c162e7a39adcc8e247c0f083db]
module.daily_snapshot.data.external.sources_tar: Read complete after 0s [id=-]
module.daily_snapshot.data.local_file.sources: Reading...
module.daily_snapshot.data.local_file.sources: Read complete after 0s [id=5fae125407607c50be3f190119b1e048dc6df824]
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/4127341138294685345]
module.daily_snapshot.digitalocean_droplet.forest: Refreshing state... [id=350149408]
module.daily_snapshot.digitalocean_firewall.forest-firewall: Refreshing state... [id=d9bc47f2-23ba-4440-ade5-e89f5ade6d5d]
module.daily_snapshot.data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.daily_snapshot.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.daily_snapshot.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-04-11T09:37:49Z" -> (known after apply)
      ~ disk                 = 160 -> (known after apply)
      ~ id                   = "350149408" -> (known after apply)
      ~ ipv4_address         = "64.226.99.155" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.3" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 8192 -> (known after apply)
        name                 = "forest-snapshot-calibnet"
      ~ price_hourly         = 0.07143 -> (known after apply)
      ~ price_monthly        = 48 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ size                 = "s-4vcpu-8gb" -> "s-8vcpu-16gb"
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
        ]
      ~ urn                  = "do:droplet:350149408" -> (known after apply)
      ~ user_data            = "bd57a7db5f4cc4d262555fe2d89bb027d715d3bc" -> "78c0c495eb2a31c66496f745a6d03312873b993c" # forces replacement
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.daily_snapshot.digitalocean_firewall.forest-firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest-firewall" {
      ~ droplet_ids     = [
          - 350149408,
        ] -> (known after apply)
        id              = "d9bc47f2-23ba-4440-ade5-e89f5ade6d5d"
        name            = "forest-snapshot-calibnet"
        tags            = []
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.daily_snapshot.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:350149408",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.daily_snapshot.digitalocean_volume.forest_storage will be created
  + resource "digitalocean_volume" "forest_storage" {
      + description             = "DB storage for snapshot generation"
      + droplet_ids             = (known after apply)
      + filesystem_label        = (known after apply)
      + filesystem_type         = (known after apply)
      + id                      = (known after apply)
      + initial_filesystem_type = "ext4"
      + name                    = "snapshot-gen-storage"
      + region                  = "fra1"
      + size                    = 400
      + urn                     = (known after apply)
    }

  # module.daily_snapshot.digitalocean_volume_attachment.attach_forest_storage will be created
  + resource "digitalocean_volume_attachment" "attach_forest_storage" {
      + droplet_id = (known after apply)
      + id         = (known after apply)
      + volume_id  = (known after apply)
    }

Plan: 3 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ ip = [
      - [
          - "64.226.99.155",
        ],
      + [
          + null,
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>